Tekla.Structures.AnalysisInternal.dotAnalysisModelAnalysisProperties_t
Serialization structure for AnalysisModelAnalysisProperties.

Tekla.Structures.AnalysisInternal.dotAnalysisModelAnalysisProperties_t.AnalysisMethod
Defines analysis method.

Tekla.Structures.AnalysisInternal.dotAnalysisModelAnalysisProperties_t.MaxIterations
Number of maximun iterations.

Tekla.Structures.AnalysisInternal.dotAnalysisModelAnalysisProperties_t.AccuracyOfIterations
Accuracy value for interations.

Tekla.Structures.AnalysisInternal.dotAnalysisModelAnalysisProperties_t.ToStruct(Tekla.Structures.Analysis.AnalysisModelAnalysisProperties)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.dotAnalysisModelAnalysisProperties_t.FromStruct(Tekla.Structures.Analysis.AnalysisModelAnalysisProperties)
DO NOT USE! For internal usage only!
P: P.